<a href="https://colab.research.google.com/github/gaelsreis/puc_rio-full_stack/blob/main/disciplina_2_aula_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PUC-Rio | Pós-graduação Full Stack
Disciplina 2 | Banco de Dados (BD)

*Professor: Sérgio Lifschitz*

Aula 3: Complemento SQL DML, consultas e visoes relacionais, índices e projeto físico

---

**Passo 1: Instalação e configuração do PostgreSQL**

Instalar o SGBD PostgreSQL

In [1]:
%%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

**Passo 2: Preparo do Esquema Relacional CARROS2**

Esquema e instância de teste do [BD EMPRESA](https://drive.google.com/file/d/1zFlLaVJIWZokadeKWICYrWhTW_I2o_Bj/view?usp=sharing). Baixar e salvar na pasta padrão do Google Drive.

In [8]:
# [2.1] Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [9]:
# [2.2] Cria o esquema no banco de dados EMPRESA no Colab
%%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS empresa CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA empresa;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f drive/MyDrive/esquema_empresa.sql

**Passo 3: Preparando para usar o SGBD PostgreSQL localmente**

In [10]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [11]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
# Ativando o esquema empresa
%%sql
SET SCHEMA 'empresa';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Esquema relacional da **base de dados Empresa**:

Seja o esquema relacional da base de dados simplificada de uma EMPRESA genérica. As chaves primárias (PK) respectivas estão em **negrito** e as chaves estrangeiras em *itálico*:

EMPREGADO (**Ident**, Nome, Sal, End, Sexo, DataNasc, *DepNum, SuperIdent*)

DEPARTAMENTO (**Num**, Nome, *IdentGer*, DataIni)

PROJETO (**Num**, Nome, Local, *DepNum*)

TRABALHONO (**IdentEmp, ProjNum**, HRS)

DEPENDENTE (**IdentEmp, Nome**, Sexo, DataNasc, Parentesco)

DEPLOC (**DepNum, Local**)

A empresa é organizada em departamentos, cada qual tendo um nome, um número de identificação e um empregado (gerente) responsável pelo mesmo. Guarda-se como informação a data a partir da qual o empregado assumiu a gerência do departamento. Um departamento pode estar presente em diversas localidades do país.

Um departamento controla um certo número de projetos, e cada projeto tem um nome, um número de identificação e uma localidade única. Os departamentos têm vários empregados, para os quais guarda-se os respectivos nomes, número de identificação (Ident) na empresa, endereço (End) residencial, sexo, data de nascimento e salário (sal) em reais. Todo empregado tem um empregado que é seu superior hierárquico (supervisor direto - SuperIdent) dentro do departamento, informação que também deve ser mantida no banco de dados.

Um empregado é alocado a um único departamento mas pode trabalhar em mais de um projeto, estes não necessariamente controlados pelo departamento ao qual ele pertence. Controla-se o total de horas semanais (HRS) em que um empregado trabalha em cada projeto.

Para fim de controle de seguro de saúde de cada empregado, deve-se manter informações dos nomes, sexo, data de nascimento e grau de parentesco de seus dependentes. Estes são identificados por seu nome mas, também, pela identidade do empregado do qual dependem.

As restrições de integridade referenciais são: o atributo SuperIdent é chave estrangeira (FK) referenciando a PK da própria tabela EMPREGADO, da mesma forma que IdentGer em DEPARTAMENTO e IdentEmp em TRABALHA_NO e DEPENDENTE. DepNum é FK para a PK Num em DEPARTAMENTO em 3 tabelas: Empregado, Projeto e DepLoc. Por fim, ProjNum é FK em TRABALHA_NO referenciando a PK Num em PROJETO.

**Consulta exemplo:** Quais empregados trabalham no Departamento de Informática?

In [13]:
# Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula!

# Se quiser, pode mudar o departamento e verificar as respostas 
# (instâncias!) distintas. Para isso consultar quais departamentos 
# existem na tabela Departamento desta instância exemplo.

# Atenção ao uso de acentos, maiúsculas e minúsculas: para SQL e para atributos
# das relações não faz diferença. Entretando, para valores sim! Se tivesse usado 
# "informática" com acento ou tudo minúsculo teria retornado uma tabela vazia.

%%sql
 
SELECT ident as IDENTIDADE, nome as NOME_EMPREGADO
FROM   empregado 
WHERE  depnum in (SELECT num 
                  FROM departamento 
                  WHERE nome = 'Informatica')

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(Decimal('8'), 'José Carlos         '),
 (Decimal('11'), 'Silvano Silva       '),
 (Decimal('14'), 'Bruno Peixoto       '),
 (Decimal('20'), 'Raphael Mendes      '),
 (Decimal('26'), 'Luana Marques       ')]

### 1. Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.

In [24]:
%%sql

select p.num as projeto, d.num as departamento
from projeto p
inner join departamento d on p.depnum = d.num
order by d.num, p.num

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(Decimal('20'), Decimal('1')),
 (Decimal('0'), Decimal('2')),
 (Decimal('90'), Decimal('3')),
 (Decimal('10'), Decimal('4')),
 (Decimal('30'), Decimal('4')),
 (Decimal('100'), Decimal('8')),
 (Decimal('70'), Decimal('11')),
 (Decimal('40'), Decimal('13')),
 (Decimal('50'), Decimal('13')),
 (Decimal('60'), Decimal('15')),
 (Decimal('80'), Decimal('15'))]

### 2. Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.

In [21]:
%%sql

select d.num, d.nome as departamento, p.num, p.nome as projeto
from projeto p
inner join departamento d on p.depnum = d.num
order by d.num, p.num

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(Decimal('1'), 'Financeiro               ', Decimal('20'), 'Pagamentos     '),
 (Decimal('2'), 'Historia                 ', Decimal('0'), 'Excursão       '),
 (Decimal('3'), 'Informatica              ', Decimal('90'), 'CorreçãoBugs   '),
 (Decimal('4'), 'Economia                 ', Decimal('10'), 'Informatizacao '),
 (Decimal('4'), 'Economia                 ', Decimal('30'), 'Reengenharia   '),
 (Decimal('8'), 'Farmacia                 ', Decimal('100'), 'Vacinação      '),
 (Decimal('11'), 'Segurança                ', Decimal('70'), 'Câmeras        '),
 (Decimal('13'), 'BioInformatica           ', Decimal('40'), 'Genoma         '),
 (Decimal('13'), 'BioInformatica           ', Decimal('50'), 'Big Data       '),
 (Decimal('15'), 'Nanotecnologia           ', Decimal('60'), 'Reagindo       '),
 (Decimal('15'), 'Nanotecnologia           ', Decimal('80'), 'NanoParticulas ')]

### 3. Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.

In [26]:
%%sql

select d.nome, d.parentesco, e.ident, e.nome
from dependente d
inner join empregado e on identemp = e.ident
order by e.ident

 * postgresql://postgres:***@localhost:5432/postgres
24 rows affected.

[('Maria               ', 'FILHA     ', Decimal('1'), 'Joao                '),
 ('João                ', 'IRMÃO     ', Decimal('1'), 'Joao                '),
 ('José                ', 'PAI       ', Decimal('1'), 'Joao                '),
 ('Carlos              ', 'PAI       ', Decimal('2'), 'Maria               '),
 ('Claudio             ', 'IRMÃO     ', Decimal('2'), 'Maria               '),
 ('Lurdes              ', 'FILHA     ', Decimal('4'), 'Ciclano             '),
 ('Lurdinalva          ', 'IRMÃ      ', Decimal('4'), 'Ciclano             '),
 ('Luan Santana        ', 'PAI       ', Decimal('4'), 'Ciclano             '),
 ('Elba Ramalho        ', 'MÃE       ', Decimal('6'), 'Luciano Mauri       '),
 ('Preta Gil           ', 'IRMÃ      ', Decimal('6'), 'Luciano Mauri       '),
 ('Fafa de Belem       ', 'MÃE       ', Decimal('8'), 'José Carlos         '),
 ('Gustavo Lima        ', 'FILHO     ', Decimal('9'), 'Maria José          '),
 ('Thaeme              ', 'IRMÃ      ', Decimal('13'), 'Jorge Sousa         '),
 ('Thiago              ', 'FILHO     ', Decimal('13'), 'Jorge Sousa         '),
 ('Maria Cecilia       ', 'PRIMA     ', Decimal('15'), 'Bruna Carla         '),
 ('Rodolfo             ', 'PAI       ', Decimal('15'), 'Bruna Carla         '),
 ('Antônio             ', 'PAI       ', Decimal('16'), 'Bianca Lourenco     '),
 ('Lucas               ', 'FILHO     ', Decimal('17'), 'Felicidade Maria    '),
 ('Tadeu               ', 'AVÔ       ', Decimal('17'), 'Felicidade Maria    '),
 ('Agueda              ', 'PRIMA     ', Decimal('17'), 'Felicidade Maria    '),
 ('Luzia               ', 'FILHA     ', Decimal('20'), 'Raphael Mendes      '),
 ('Ines                ', 'FILHA     ', Decimal('21'), 'Raphaela Fontoura   '),
 ('Anastacia           ', 'MÃE       ', Decimal('23'), 'Paola Silva         '),
 ('Rita                ', 'AVÓ       ', Decimal('23'), 'Paola Silva         ')]

### 4. Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.

In [28]:
%%sql

select e.nome as empregado, e.sexo, e.superident, s.nome as superior
from empregado e
inner join empregado s on e.superident = s.ident
order by e.superident

 * postgresql://postgres:***@localhost:5432/postgres
18 rows affected.

[('Johnny Depp         ', 'M', Decimal('2'), 'Maria               '),
 ('Ciclano             ', 'M', Decimal('2'), 'Maria               '),
 ('Jorge Sousa         ', 'M', Decimal('6'), 'Luciano Mauri       '),
 ('Leandro Silva       ', 'M', Decimal('7'), 'João Maria          '),
 ('Marcos Guedes       ', 'M', Decimal('7'), 'João Maria          '),
 ('Bruno Peixoto       ', 'M', Decimal('8'), 'José Carlos         '),
 ('Luana Marques       ', 'F', Decimal('10'), 'Johnny Depp         '),
 ('João Maria          ', 'M', Decimal('10'), 'Johnny Depp         '),
 ('Bruna Carla         ', 'F', Decimal('10'), 'Johnny Depp         '),
 ('Maria José          ', 'F', Decimal('11'), 'Silvano Silva       '),
 ('Luciano Mauri       ', 'M', Decimal('15'), 'Bruna Carla         '),
 ('Bianca Lourenco     ', 'F', Decimal('16'), 'Bianca Lourenco     '),
 ('Silvano Silva       ', 'M', Decimal('17'), 'Felicidade Maria    '),
 ('Ariane Goncalves    ', 'F', Decimal('18'), 'Luciana Fernandes   '),
 ('Luciana Fernandes   ', 'F', Decimal('21'), 'Raphaela Fontoura   '),
 ('Felicidade Maria    ', 'F', Decimal('22'), 'Laura Benayon       '),
 ('Laura Benayon       ', 'F', Decimal('25'), 'Natasha Gasparelli  '),
 ('Paola Silva         ', 'F', Decimal('27'), 'Simone Estoggliato  ')]

### 5. Listar os diferentes valores de salários pagos aos empregados da empresa.

In [30]:
%%sql

select distinct sal
from empregado
order by sal

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[(Decimal('2.00'),),
 (Decimal('1000.00'),),
 (Decimal('1245.00'),),
 (Decimal('2000.00'),),
 (Decimal('5222.00'),),
 (Decimal('5598.00'),),
 (Decimal('5878.00'),),
 (Decimal('6554.00'),),
 (Decimal('7500.00'),),
 (Decimal('10000.00'),),
 (Decimal('11255.00'),),
 (Decimal('12335.00'),),
 (Decimal('22233.00'),),
 (Decimal('23265.00'),),
 (Decimal('30001.00'),)]

### 6. Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?

In [35]:
%%sql

select distinct e.nome as empregado
from empregado e
inner join trabalhano t on e.ident = t.identemp
where t.hrs < 20
order by e.nome

 * postgresql://postgres:***@localhost:5432/postgres
27 rows affected.

[('Ariane Goncalves    ',),
 ('Bianca Lourenco     ',),
 ('Bruna Carla         ',),
 ('Bruno Peixoto       ',),
 ('Caetano Veloso      ',),
 ('Ciclano             ',),
 ('Felicidade Maria    ',),
 ('Joao                ',),
 ('João Maria          ',),
 ('Johnny Depp         ',),
 ('Jorge Sousa         ',),
 ('José Carlos         ',),
 ('Laura Benayon       ',),
 ('Leandro Silva       ',),
 ('Luana Marques       ',),
 ('Luciana Fernandes   ',),
 ('Luciano Mauri       ',),
 ('Marcos Guedes       ',),
 ('Maria               ',),
 ('Maria José          ',),
 ('Natasha Gasparelli  ',),
 ('Paola Silva         ',),
 ('Raphaela Fontoura   ',),
 ('Raphael Mendes      ',),
 ('Severino Buarque    ',),
 ('Silvano Silva       ',),
 ('Simone Estoggliato  ',)]

### 7. Apresentar os nomes de todos os empregados que não têm dependentes.

In [36]:
%%sql

select e.nome
from empregado e
where not exists (select 1 from dependente d where d.identemp = e.ident)

 * postgresql://postgres:***@localhost:5432/postgres
14 rows affected.

[('Silvano Silva       ',),
 ('Bruno Peixoto       ',),
 ('Luciana Fernandes   ',),
 ('Marcos Guedes       ',),
 ('Natasha Gasparelli  ',),
 ('Luana Marques       ',),
 ('Simone Estoggliato  ',),
 ('Ariane Goncalves    ',),
 ('Leandro Silva       ',),
 ('João Maria          ',),
 ('Severino Buarque    ',),
 ('Laura Benayon       ',),
 ('Caetano Veloso      ',),
 ('Johnny Depp         ',)]

### 8. Quais empregados tem cargos de chefia, isto é, não têm superior imediato?

In [37]:
%%sql

select nome
from empregado
where superident is null

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[('Maria               ',),
 ('José Carlos         ',),
 ('Raphael Mendes      ',),
 ('Natasha Gasparelli  ',),
 ('Simone Estoggliato  ',),
 ('Raphaela Fontoura   ',),
 ('Severino Buarque    ',),
 ('Caetano Veloso      ',),
 ('Joao                ',)]

### 9. Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.

In [88]:
%%sql

select distinct l.local from deploc l
union
select distinct p.local from projeto p
order by local

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('Belo Horizonte ',),
 ('Cabo Frio      ',),
 ('Florianopolis  ',),
 ('Natal          ',),
 ('Porto Alegre   ',),
 ('Queimadas      ',),
 ('Rio de Janeiro ',),
 ('Salvador       ',),
 ('São Paulo      ',),
 ('Vitoria        ',)]

### 10. Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.

In [57]:
%%sql

select e.nome, e.sal * 1.1 as aumento
from empregado e
inner join trabalhano t on e.ident = t.identemp
inner join projeto p on t.projnum = p.num
where p.nome = 'Reengenharia'
order by sal

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('Ciclano             ', Decimal('1100.000')),
 ('Caetano Veloso      ', Decimal('2200.000')),
 ('Bruna Carla         ', Decimal('6465.800')),
 ('João Maria          ', Decimal('11000.000')),
 ('Raphael Mendes      ', Decimal('24456.300')),
 ('Johnny Depp         ', Decimal('33001.100'))]

### 11. Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?

In [90]:
%%sql

select e.nome as empregado, d.num, d.nome as departamento
from empregado e
left join departamento d on e.ident = d.identger
order by e.nome

 * postgresql://postgres:***@localhost:5432/postgres
30 rows affected.

[('Ariane Goncalves    ', Decimal('10'), 'Matematica               '),
 ('Bianca Lourenco     ', None, None),
 ('Bruna Carla         ', Decimal('9'), 'Entregas                 '),
 ('Bruno Peixoto       ', None, None),
 ('Caetano Veloso      ', Decimal('5'), 'Biologia                 '),
 ('Ciclano             ', None, None),
 ('Felicidade Maria    ', None, None),
 ('Joao                ', Decimal('11'), 'Segurança                '),
 ('Joao                ', Decimal('15'), 'Nanotecnologia           '),
 ('João Maria          ', Decimal('6'), 'RH                       '),
 ('Johnny Depp         ', Decimal('8'), 'Farmacia                 '),
 ('Jorge Sousa         ', Decimal('2'), 'Historia                 '),
 ('José Carlos         ', None, None),
 ('Laura Benayon       ', None, None),
 ('Leandro Silva       ', Decimal('13'), 'BioInformatica           '),
 ('Luana Marques       ', None, None),
 ('Luciana Fernandes   ', None, None),
 ('Luciano Mauri       ', Decimal('12'), 'Fisica                   '),
 ('Marcos Guedes       ', None, None),
 ('Maria               ', Decimal('28319'), 'Pesquisa                 '),
 ('Maria               ', Decimal('4'), 'Economia                 '),
 ('Maria               ', Decimal('3'), 'Informatica              '),
 ('Maria José          ', Decimal('7'), 'Pessoal                  '),
 ('Natasha Gasparelli  ', None, None),
 ('Paola Silva         ', Decimal('1'), 'Financeiro               '),
 ('Raphaela Fontoura   ', Decimal('14'), 'Quimica                  '),
 ('Raphael Mendes      ', None, None),
 ('Severino Buarque    ', Decimal('9000'), 'Engenharia               '),
 ('Silvano Silva       ', None, None),
 ('Simone Estoggliato  ', None, None)]

### 12. Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome *Pesquisa*

In [67]:
%%sql

select d.nome as departamentos, e.nome as empregados, sal
from empregado e
inner join departamento d on e.depnum = d.num
where e.sal > (select max(e2.sal) from empregado e2, departamento d2 where e2.depnum = d2.num and d2.nome = 'Pesquisa')
order by sal

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Historia                 ', 'Bianca Lourenco     ', Decimal('12335.00')),
 ('Informatica              ', 'Raphael Mendes      ', Decimal('22233.00')),
 ('Informatica              ', 'Silvano Silva       ', Decimal('22233.00')),
 ('Historia                 ', 'Natasha Gasparelli  ', Decimal('22233.00')),
 ('Matematica               ', 'Ariane Goncalves    ', Decimal('23265.00')),
 ('Nanotecnologia           ', 'Luciano Mauri       ', Decimal('23265.00')),
 ('Economia                 ', 'Marcos Guedes       ', Decimal('23265.00')),
 ('Farmacia                 ', 'Johnny Depp         ', Decimal('30001.00'))]

### 13. Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha

In [76]:
%%sql

select distinct e.nome
from empregado e
inner join trabalhano t on e.ident = t.identemp
where t.projnum in (select t2.projnum from trabalhano t2, empregado e2 where e2.ident = t2.identemp and e2.nome = 'Caetano Veloso' and t2.hrs = t.hrs)
and e.nome <> 'Caetano Veloso'

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('Johnny Depp         ',), ('Leandro Silva       ',)]

### 14. Quais empregados ganham o maior salário? Listar identidade, nome e salário.

In [87]:
%%sql

select ident, nome, sal
from empregado
where sal = (select max(sal) from empregado)

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('10'), 'Johnny Depp         ', Decimal('30001.00'))]

### 15. Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?

In [86]:
%%sql

select ident, nome, sal
from empregado e
where 3 > (select count(distinct sal) from empregado e2 where e2.sal > e.sal)
order by sal desc

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[(Decimal('10'), 'Johnny Depp         ', Decimal('30001.00')),
 (Decimal('19'), 'Ariane Goncalves    ', Decimal('23265.00')),
 (Decimal('6'), 'Luciano Mauri       ', Decimal('23265.00')),
 (Decimal('24'), 'Marcos Guedes       ', Decimal('23265.00')),
 (Decimal('25'), 'Natasha Gasparelli  ', Decimal('22233.00')),
 (Decimal('20'), 'Raphael Mendes      ', Decimal('22233.00')),
 (Decimal('11'), 'Silvano Silva       ', Decimal('22233.00'))]